#include "global.h"
#include "vt.h"

u32 D_8012AC90[] = {
    0x00000000,
    0x00010000,
    0x00020000,
    0x00030000,
};

u32 D_8012ACA0[] = {
    0x00000002, 0x000A000C, 0x00020004, 0x000C000E, 0x000A000C, 0x00140016, 0x000C000E, 0x00160018,
    0x00010003, 0x00050006, 0x00070008, 0x0009000B, 0x000D000F, 0x00100011, 0x00120013, 0x00150017,
    0x00140016, 0x001E0020, 0x00160018, 0x00200022, 0x001E0020, 0x0028002A, 0x00200022, 0x002A002C,
    0x00150017, 0x0019001A, 0x001B001C, 0x001D001F, 0x00210023, 0x00240025, 0x00260027, 0x0029002B,
};

u32 D_8012AD20[] = {
    0x00000FC0,
    0x1F802F40,
    0x3F000000,
};

u32 D_8012AD2C[] = {
    0x000007C0, 0x0F801740, 0x1F0026C0, 0x2E803640, 0x3E000000,
};

u32 D_8012AD40[] = {
    0x00000010, 0x00130012, 0x00100001, 0x00140013, 0x00010011, 0x00150014, 0x00110005, 0x00160015,
    0x00120013, 0x00170002, 0x00130014, 0x00030017, 0x00140015, 0x00180003, 0x00150016, 0x00070018,
    0x00020017, 0x001A0019, 0x00170003, 0x001B001A, 0x00030018, 0x001C001B, 0x00180007, 0x001D001C,
    0x0019001A, 0x001E000A, 0x001A001B, 0x000B001E, 0x001B001C, 0x001F000B, 0x001C001D, 0x000F001F,
};

u32 D_8012ADC0[] = {
    0x00000000, 0x00002000, 0x00004000, 0x00006000, 0x00008000, 0x0000C000,
};

u32 D_8012ADD8[] = {
    0x00000002, 0x000A000C, 0x00020004, 0x000C000E, 0x000A000C, 0x00140016, 0x000C000E, 0x00160018,
    0x00010003, 0x00050006, 0x00070008, 0x0009000B, 0x000D000F, 0x00100011, 0x00120013, 0x00150017,
};

u32 D_8012AE18[] = {
    0x000007C0,
    0x0F801740,
    0x1F000000,
};

u32 D_8012AE24[] = {
    0x000007C0,
    0x0F801740,
    0x1F000000,
};

u32 D_8012AE30[] = {
    0x000007C0,
    0x0F8007C0,
    0x00000000,
};

u32 D_8012AE3C[] = {
    0x00000010, 0x00130012, 0x00100001, 0x00140013, 0x00010011, 0x00150014, 0x00110005, 0x00160015,
    0x00120013, 0x00170002, 0x00130014, 0x00030017, 0x00140015, 0x00180003, 0x00150016, 0x00070018,
    0x00020017, 0x001A0019, 0x00170003, 0x001B001A, 0x00030018, 0x001C001B, 0x00180007, 0x001D001C,
    0x0019001A, 0x001E000A, 0x001A001B, 0x000B001E, 0x001B001C, 0x001F000B, 0x001C001D, 0x000F001F,
};

typedef struct {
    /* 0x000 */ s32 x; // X position of a corner of the sky cube
    /* 0x004 */ s32 y; // Y position of a corner of the sky cube
    /* 0x008 */ s32 z; // Z position of a corner of the sky cube
    /* 0x00C */ s32 width; // Width of the subdivisions
    /* 0x010 */ s32 height; // Height of the subdivisions
} SkyCubeInfo; // size = 0x14

// Kankyo data
typedef struct {
    /* 0x00 */ u16 unk_0; // start
    /* 0x02 */ u16 unk_2; // end
    /* 0x04 */ u8 unk_4;
    /* 0x05 */ u8 unk_5; // img idx 1
    /* 0x06 */ u8 unk_6; // img idx 2
    /* 0x07 */ char unk_7[0x1];
} Struct_8011FC1C; // size = 0x8

typedef struct {
    /* 0x00 */ u32 unk_0; // start
    /* 0x04 */ u32 unk_4; // end
    /* 0x08 */ u32 unk_8; // pal start
    /* 0x0C */ u32 unk_C; // pal end
} Struct_8011FD3C; // size = 0x10

extern Struct_8011FC1C D_8011FC1C[8][9];
extern Struct_8011FD3C D_8011FD3C[];

s32 func_800ADBB0(SkyboxContext *skyboxCtx, Vtx *roomVtx, s32, UNK_TYPE, UNK_TYPE, UNK_TYPE, UNK_TYPE, UNK_TYPE, s32, s32);
#pragma GLOBAL_ASM("asm/non_matchings/code/z_vr_box/func_800ADBB0.s")

s32 func_800AE2C0(SkyboxContext *skyboxCtx, Vtx *roomVtx, s32, UNK_TYPE, UNK_TYPE, UNK_TYPE, UNK_TYPE, UNK_TYPE, s32);
#pragma GLOBAL_ASM("asm/non_matchings/code/z_vr_box/func_800AE2C0.s")

// Used for prerenders, has only 4 sides
void func_800AEFC8(SkyboxContext* skyboxCtx, s16 skyboxId) {
    static SkyCubeInfo D_8012AEBC[] = {
        { -126, 124, -126, 63, -31 },
        { 126, 124, -126, 63, -31 },
        { 126, 124, 126, -63, -31 },
        { -126, 124, 126, -63, -31 },
    };
    s32 phi_s1;
    s32 phi_s2;
    s32 phi_s3 = 0;

    if (skyboxId == 2 || (skyboxId > 16 && skyboxId < 25)) {
